Nedu41/SuDepoSis_v2/esp8266_slave/src/main.cpp
      response += "\n";
      rs485Gonder(response.c_str());
      buffer = "";
    } else if (c != '\r') {
      buffer += c;
    }
  }
}

// ============ SILINDIK HACIM ============
float silindirHacimLitre(float y, float cap, float maxL) {
  float r = cap / 2.0;
  if (r <= 0 || maxL <= 0) return 0;
  if (y <= 0) return 0;
  if (y >= cap) return maxL;
  float u = (maxL * 1000.0) / (PI * r * r);
  float p = (r - y) / r;
  if (p > 1) p = 1; if (p < -1) p = -1;
  float k = 2 * r * y - y * y;
  if (k < 0) k = 0;
  float a = r * r * acos(p) - (r - y) * sqrt(k);
  float l = (a * u) / 1000.0;
  if (l < 0) l = 0; if (l > maxL) l = maxL;
  return l;
}

// ============ HC-SR04 ============
float measureDistance() {
  digitalWrite(TRIG_PIN, LOW); delayMicroseconds(2);
  digitalWrite(TRIG_PIN, HIGH); delayMicroseconds(10);
  digitalWrite(TRIG_PIN, LOW);
  long s = pulseIn(ECHO_PIN, HIGH, 30000);
  if (s == 0) return -1;
  float d = s * 0.034 / 2;
  if (d < 2 || d > 450) return -1;
  return d;
}

float olcumOrtalama() {
  float d[3]; int n = 0;
  for (int i = 0; i < 3; i++) {
    float v = measureDistance();
    if (v > 0) d[n++] = v;
    delay(50);
  }
  if (n == 0) return -1;
  if (n == 1) return d[0];
  for (int i = 0; i < n-1; i++)
    for (int j = i+1; j < n; j++)
      if (d[j] < d[i]) { float t = d[i]; d[i] = d[j]; d[j] = t; }
  return d[n/2];
}

// ============ OLCUM ============
void olcumYap() {
  moistureOku();
  applyMoistureControl();
  float m = olcumOrtalama();
  if (m > 0 && m < 500) {
    sensorHatasi = false;
    float kul = ayar.bosMesafe - ayar.doluMesafe;
    if (kul <= 0) kul = 1;
    float s = ayar.bosMesafe - m;
    if (s < 0) s = 0; if (s > kul) s = kul;
    sonSeviyeCm = s;
    if (ayar.depoYatay) {
      sonLitre = silindirHacimLitre(s, kul, ayar.depoKapasiteLitre);
      sonYuzde = (ayar.depoKapasiteLitre > 0) ? (sonLitre / ayar.depoKapasiteLitre) * 100.0 : 0;
    } else {
      sonYuzde = (s / kul) * 100.0;
      sonLitre = (sonYuzde / 100.0) * ayar.depoKapasiteLitre;
    }
    alarmAktif = (sonYuzde <= ayar.alarmSeviyeYuzde);
    sonOlcumZamani = simdikiZamanStr();

    if (ilkOlcumTamamlandi) {
      float fark = sonLitre - oncekiSonLitre;
      if (fark > NOISE_ESIK_LITRE) {
        if (!dolumDevamEdiyor) { dolumDevamEdiyor = true; dolumBaslangicLitre = oncekiSonLitre; }
        dolumSonPikLitre = sonLitre;
        kacakSuruyor = false; kacakAlarmi = false;
      } else {
        if (dolumDevamEdiyor) {
          float toplamArtis = dolumSonPikLitre - dolumBaslangicLitre;
          if (toplamArtis >= ayar.minDolumLitre) {
            File f = LittleFS.open(KAYIT_DOSYASI, "a");
            if (f) {
              f.print(simdikiTarihISO()); f.print(",");
              f.print("Otomatik Tespit,"); f.print(toplamArtis, 1); f.print(",0,Belirsiz\n");
              f.close();
              kayitlariSiniraGetir(MAX_KAYIT_SAYISI);
            }
          }
          dolumDevamEdiyor = false;
        }
        if (fark < -NOISE_ESIK_LITRE) {
          float dusus = -fark;
          String simdiTarih = simdikiTarihISO();
          String simdiYilAy = simdikiYilAy();
          if (simdiTarih.length() > 0) {
            if (gunlukTarih.length() > 0 && gunlukTarih != simdiTarih) {
              if (gunlukTuketim > 0) {
                File f = LittleFS.open(TUKETIM_GECMIS_DOSYASI, "a");
                if (f) { f.print(gunlukTarih); f.print(","); f.println(gunlukTuketim, 1); f.close(); }
              }
              gunlukTuketim = 0;
            }
            gunlukTarih = simdiTarih;
            if (aylikYilAy.length() > 0 && aylikYilAy != simdiYilAy) aylikTuketim = 0;
            aylikYilAy = simdiYilAy;
            gunlukTuketim += dusus; aylikTuketim += dusus;
            File f = LittleFS.open(TUKETIM_DOSYASI, "w");
            if (f) {
              f.print(gunlukTarih); f.print(","); f.print(gunlukTuketim, 1); f.print(",");
              f.print(aylikYilAy); f.print(","); f.println(aylikTuketim, 1);
              f.close();
            }
          }
          if (!kacakSuruyor) { kacakSuruyor = true; kacakBaslangicMs = millis(); kacakAlarmi = false; }
          if (!kacakAlarmi && (millis() - kacakBaslangicMs) / 60000UL >= ayar.kacakEsikDakika) kacakAlarmi = true;
        } else {
          kacakSuruyor = false; kacakAlarmi = false;
        }
      }
    } else {
      ilkOlcumTamamlandi = true;
      tuketimYukle();
    }
    oncekiSonLitre = sonLitre;

    DEBUG_PRINTF("Olcum: %.1f cm (%.1f%%) ~%.0f L\n", sonSeviyeCm, sonYuzde, sonLitre);
  } else {
    sensorHatasi = true;
    DEBUG_PRINTLN("Sensor hatasi!");
  }
}

void tuketimYukle() {
  gunlukTarih = simdikiTarihISO(); aylikYilAy = simdikiYilAy();
  gunlukTuketim = 0; aylikTuketim = 0;
  File f = LittleFS.open(TUKETIM_DOSYASI, "r");
  if (!f) return;
  String satir = f.readStringUntil('\n'); f.close(); satir.trim();
  if (satir.length() == 0) return;
  int p1 = satir.indexOf(','), p2 = satir.indexOf(',', p1+1), p3 = satir.indexOf(',', p2+1);
  if (p1 < 0 || p2 < 0 || p3 < 0) return;
  String t = satir.substring(0, p1); float g = satir.substring(p1+1, p2).toFloat();
  String y = satir.substring(p2+1, p3); float a = satir.substring(p3+1).toFloat();
  if (gunlukTarih.length() > 0 && t == gunlukTarih) gunlukTuketim = g;
  if (aylikYilAy.length() > 0 && y == aylikYilAy) aylikTuketim = a;
}

// ============ KAYIT ISLEMLERI ============
String csvTemizle(String s) { s.replace(",", " "); s.replace("\n", " "); s.replace("\r", " "); return s; }

// Sadece en son MAX_KAYIT_SAYISI kaydi tutar, daha eskileri siler.
void kayitlariSiniraGetir(int maxKayit) {
  File f = LittleFS.open(KAYIT_DOSYASI, "r");
  if (!f) return;
  int toplam = 0;
  while (f.available()) { String s = f.readStringUntil('\n'); s.trim(); if (s.length() > 0) toplam++; }
  f.close();
  if (toplam <= maxKayit) return;

  int atlanacak = toplam - maxKayit;
  File k = LittleFS.open(KAYIT_DOSYASI, "r");
  File g = LittleFS.open("/k_tmp.csv", "w");
  if (!k || !g) { if (k) k.close(); if (g) g.close(); return; }
  int i = 0;
  while (k.available()) {
    String s = k.readStringUntil('\n'); s.trim(); if (s.length() == 0) continue;
    if (i >= atlanacak) g.println(s);
    i++;
  }
  k.close(); g.close();
  LittleFS.remove(KAYIT_DOSYASI); LittleFS.rename("/k_tmp.csv", KAYIT_DOSYASI);
}

bool kayitEkle(String tarih, String kisi, float litre, float ucret, String kaynak) {
  File f = LittleFS.open(KAYIT_DOSYASI, "a");
  if (!f) return false;
  f.print(csvTemizle(tarih)); f.print(",");
  f.print(csvTemizle(kisi)); f.print(",");
  f.print(litre, 1); f.print(",");
  f.print(ucret, 2); f.print(",");
  f.println(csvTemizle(kaynak));
  f.close();
  kayitlariSiniraGetir(MAX_KAYIT_SAYISI);
  return true;
}

String kayitlariOkuJSON(int maxKayit) {
  File f = LittleFS.open(KAYIT_DOSYASI, "r");
  if (!f) return "[]";
  String json = "["; bool ilk = true; int i = 0;
  while (f.available()) {
    String satir = f.readStringUntil('\n'); satir.trim();
    if (satir.length() == 0) continue;
    int p1 = satir.indexOf(','), p2 = satir.indexOf(',', p1+1), p3 = satir.indexOf(',', p2+1), p4 = satir.indexOf(',', p3+1);
    if (p1 >= 0 && p2 >= 0 && p3 >= 0 && p4 >= 0) {
      if (!ilk) json += ",";
      json += "{\"index\":" + String(i) + ",\"tarih\":\"" + satir.substring(0, p1) + "\",\"kisi\":\"" + satir.substring(p1+1, p2) +
           "\",\"litre\":" + satir.substring(p2+1, p3) + ",\"ucret\":" + satir.substring(p3+1, p4) + ",\"kaynak\":\"" + satir.substring(p4+1) + "\"}";
      ilk = false;
    }
    i++; if (i >= maxKayit) break;
  }
  f.close(); json += "]"; return json;
}

struct KayitOzeti {
  float toplamLitre = 0, toplamUcret = 0;
  float ayLitre = 0, ayUcret = 0;
  float ayYagmur = 0, aySebeke = 0, ayTanker = 0;
  int kayitSayisi = 0, belirsizSayisi = 0;
};

void kayitOzet(KayitOzeti& o) {
  File f = LittleFS.open(KAYIT_DOSYASI, "r");
  if (!f) return;
  String by = simdikiYilAy();
  while (f.available()) {
    String satir = f.readStringUntil('\n'); satir.trim();
    if (satir.length() == 0) continue;
    int p1 = satir.indexOf(','), p2 = satir.indexOf(',', p1+1), p3 = satir.indexOf(',', p2+1), p4 = satir.indexOf(',', p3+1);
    if (p1 < 0 || p2 < 0 || p3 < 0 || p4 < 0) continue;
    String th = satir.substring(0, p1);
    float l = satir.substring(p2+1, p3).toFloat(), u = satir.substring(p3+1, p4).toFloat();
    String ky = satir.substring(p4+1);
    o.toplamLitre += l; o.toplamUcret += u; o.kayitSayisi++;
    if (ky == "Belirsiz") o.belirsizSayisi++;
    if (by.length() > 0 && th.startsWith(by)) {
      o.ayLitre += l; o.ayUcret += u;
      if (ky == "Yagmur") o.ayYagmur += l;
      else if (ky == "Sebeke") o.aySebeke += l;
      else if (ky == "Tanker") o.ayTanker += l;
    }
  }
  f.close();
}

bool kayitSil(int idx) {
  File k = LittleFS.open(KAYIT_DOSYASI, "r"); if (!k) return false;
  File g = LittleFS.open("/k_tmp.csv", "w"); if (!g) { k.close(); return false; }
  int i = 0; bool bul = false;
  while (k.available()) {
    String s = k.readStringUntil('\n'); s.trim(); if (s.length() == 0) continue;
    if (i == idx) { bul = true; i++; continue; }
    g.println(s); i++;
  }
  k.close(); g.close();
  LittleFS.remove(KAYIT_DOSYASI); LittleFS.rename("/k_tmp.csv", KAYIT_DOSYASI);
  return bul;
}

bool kayitGuncelle(int idx, String t, String k, float l, float u, String ky) {
  File kD = LittleFS.open(KAYIT_DOSYASI, "r"); if (!kD) return false;
  File g = LittleFS.open("/k_tmp.csv", "w"); if (!g) { kD.close(); return false; }
  int i = 0; bool bul = false;
  while (kD.available()) {
    String s = kD.readStringUntil('\n'); s.trim(); if (s.length() == 0) continue;
    if (i == idx) {
      g.print(csvTemizle(t)); g.print(","); g.print(csvTemizle(k)); g.print(",");
      g.print(l, 1); g.print(","); g.print(u, 2); g.print(","); g.println(csvTemizle(ky));
      bul = true;
    } else { g.println(s); }
    i++;
  }
  kD.close(); g.close();
  LittleFS.remove(KAYIT_DOSYASI); LittleFS.rename("/k_tmp.csv", KAYIT_DOSYASI);
  return bul;
}

// ============ DURUM JSON ============
String durumJson() {
  String j = "{";
  j += "\"firmwareBuild\":\"" __DATE__ " " __TIME__ "\",";
  j += "\"seviye\":" + String(sonSeviyeCm, 1) + ",";
  j += "\"yuzde\":" + String(sonYuzde, 1) + ",";
  j += "\"litre\":" + String(sonLitre, 0) + ",";
  j += "\"zaman\":\"" + sonOlcumZamani + "\",";
  j += "\"alarm\":" + String(alarmAktif ? "true" : "false") + ",";
  j += "\"sensorHata\":" + String(sensorHatasi ? "true" : "false") + ",";
  j += "\"gece\":" + String(geceModuMu() ? "true" : "false") + ",";
  j += "\"kapi1Acik\":" + String(kapi1Acik ? "true" : "false") + ",";
  j += "\"kapi2Acik\":" + String(kapi2Acik ? "true" : "false") + ",";
  j += "\"nanoBagli\":" + String(nanoBaglantiVar ? "true" : "false") + ",";
  j += "\"roleFizikselDurum\":" + String(roleFizikselDurum ? "true" : "false") + ",";
  j += "\"lambaAcik\":" + String(lambaAcik ? "true" : "false") + ",";
  j += "\"moistureRaw\":" + String(moistureRaw) + ",";
  j += "\"moisturePercent\":" + String(moisturePercent, 1) + ",";
  j += "\"moistureOutput\":" + String(moistureOutputActive ? "true" : "false") + ",";
  j += "\"moistureAuto\":" + String(ayar.moistureAutomatic ? "true" : "false") + ",";
  j += "\"moistureLow\":" + String(ayar.moistureThresholdLow) + ",";
  j += "\"moistureHigh\":" + String(ayar.moistureThresholdHigh) + ",";
  j += "\"gunlukTuketim\":" + String(gunlukTuketim, 1) + ",";
  j += "\"aylikTuketim\":" + String(aylikTuketim, 1) + ",";
  j += "\"kacakAlarmi\":" + String(kacakAlarmi ? "true" : "false") + ",";
  j += "\"kacakDakika\":" + String(kacakSuruyor ? (millis() - kacakBaslangicMs) / 60000UL : 0) + ",";
   j += "\"roleAktif\":" + String(ayar.alarmRoleAktif ? "true" : "false") + ",";
   j += "\"roleTetikli\":" + String(roleFizikselDurum ? "true" : "false") + ",";
   j += "\"lamba\":" + String(lambaAcik ? "true" : "false") + ",";
   j += "\"pirAcik\":" + String(pirAcik ? "true" : "false") + ",";
   j += "\"panicAktif\":" + String(panicRoleAktif ? "true" : "false") + ",";
   j += "\"pirTetikleyici\":" + String(pirTetikleyici ? "true" : "false") + ",";
   j += "\"pirDarbeSayisiPencerede\":" + String(pirDarbeSayisiPencerede) + ",";
   j += "\"alarmTetikleyenMask\":" + String(alarmTetikleyenMask) + ",";
   j += "\"triggerGunduz\":" + String(ayar.alarmTriggerGunduz) + ",";
   j += "\"triggerGece\":" + String(ayar.alarmTriggerGece) + ",";
   j += "\"alarmMod\":" + String(ayar.alarmMod) + ",";
   j += "\"alarmSusturuldu\":" + String(alarmSusturuldu ? "true" : "false") + ",";
   j += "\"alarmOnayBekliyor\":" + String(alarmOnayBekliyor ? "true" : "false") + ",";
   j += "\"alarmOnaylandi\":" + String(alarmOnaylandi ? "true" : "false") + ",";
   j += "\"alarmOnaySadeceLamba\":" + String(alarmOnaySadeceLamba ? "true" : "false") + ",";
   j += "\"rolePolariteHigh\":" + String(rolePolariteHigh ? "true" : "false") + ",";
   j += "\"yagmurSulamaAtla\":" + String(yagmurSulamaAtlaGecerli() ? "true" : "false");
   j += "}";
  return j;
}

// ============ CSS ============
void handleCSS() {
  String css = ":root{--bg1:#e3f2fd;--bg2:#bbdefb;--card:#fff;--text:#222;--muted:#666;--primary:#1976d2;--accent:#4CAF50;--warn:#FF9800;--danger:#e53935;--danger-bg:#ffebee;--input-bg:#fff;--input-border:#ddd;--tab-bg:#eef3f8;--shadow:rgba(0,0,0,.1)}";
  css += ".dark{--bg1:#0f1720;--bg2:#182430;--card:#1c2733;--text:#e8eef4;--muted:#9aa7b4;--primary:#64b5f6;--accent:#66bb6a;--warn:#ffb74d;--danger:#ef5350;--danger-bg:#3a2222;--input-bg:#243140;--input-border:#3a4a5a;--tab-bg:#243140;--shadow:rgba(0,0,0,.4)}";
  css += "*{margin:0;padding:0;box-sizing:border-box}";
  css += "body{font-family:-apple-system,sans-serif;background:linear-gradient(135deg,var(--bg1),var(--bg2));min-height:100vh;padding:16px;color:var(--text);max-width:460px;margin:0 auto;transition:background .3s,color .3s}";
  css += ".topbar{display:flex;align-items:center;justify-content:space-between;margin-bottom:14px}";
  css += ".topbar h1{color:var(--primary);font-size:22px}";
  css += ".tema-btn{background:var(--card);border:none;border-radius:50%;width:42px;height:42px;font-size:18px;cursor:pointer;box-shadow:0 2px 8px var(--shadow)}";
  css += ".sekmeler{display:flex;background:var(--tab-bg);border-radius:14px;padding:4px;margin-bottom:16px}";
  css += ".sekme-btn{flex:1;border:none;background:transparent;padding:10px 4px;border-radius:10px;font-size:13px;color:var(--muted);cursor:pointer}";
  css += ".sekme-btn.aktif{background:var(--card);color:var(--primary);font-weight:bold;box-shadow:0 2px 6px var(--shadow)}";
  css += ".card{background:var(--card);border-radius:18px;padding:20px;margin-bottom:16px;box-shadow:0 6px 20px var(--shadow)}";
  css += ".card h3{color:var(--primary);margin-bottom:14px;font-size:16px}";
  css += ".zaman-bilgisi{background:var(--tab-bg);padding:10px;border-radius:10px;margin-bottom:14px;font-size:12px;color:var(--muted);text-align:center}";
  css += ".alarm-kutu{background:var(--danger-bg);color:var(--danger);border:2px solid var(--danger);padding:10px;border-radius:10px;margin-bottom:14px;font-weight:bold;text-align:center;animation:pulse 1.5s infinite}";
  css += "@keyframes pulse{0%{opacity:1}50%{opacity:.6}100%{opacity:1}}";
  css += ".depo-container{display:flex;justify-content:center;margin:10px 0 20px}";
  css += ".depo{width:170px;height:230px;background:var(--tab-bg);border-radius:20px 20px 10px 10px;position:relative;overflow:hidden;border:3px solid var(--primary)}";
  css += ".su{position:absolute;bottom:0;left:0;right:0;background:linear-gradient(180deg,#42a5f5,#1976d2);transition:height 1s;border-radius:0 0 8px 8px}";
  css += ".su-dalga{position:absolute;bottom:100%;left:-50%;width:200%;height:15px;background:rgba(255,255,255,.3);border-radius:50%;animation:dalga 3s ease-in-out infinite}";
  css += "@keyframes dalga{0%{transform:translateX(0)}50%{transform:translateX(25%) translateY(-5px)}100%{transform:translateX(0)}}";
  css += ".seviye-text{position:absolute;top:50%;left:50%;transform:translate(-50%,-50%);font-size:22px;font-weight:bold;color:#fff;text-shadow:0 2px 10px rgba(0,0,0,.5);z-index:2}";
  css += ".info{padding:14px;background:var(--tab-bg);border-radius:12px;margin:10px 0}";
  css += ".info p{margin:6px 0;font-size:15px}";
  css += ".info strong{color:var(--primary)}";
  css += ".btn-satir{display:flex;gap:8px;margin:16px 0 6px}";
  css += ".btn{flex:1;color:white;padding:12px 10px;border-radius:12px;border:none;font-size:14px;cursor:pointer;font-weight:600}";
  css += ".btn:active{transform:scale(.96)}";
  css += ".btn-yesil{background:var(--accent)}.btn-turuncu{background:var(--warn)}.btn-mavi{background:var(--primary);width:100%;margin-top:12px}.btn-kirmizi{background:var(--danger);width:100%;margin-top:10px}";
  css += ".btn-satir .btn-mavi,.btn-satir .btn-kirmizi{width:auto;margin-top:0}";
  css += "label{display:block;font-size:12px;color:var(--muted);margin-top:10px}";
  // Checkbox gruplari (Zaman Bazli Tetikleyiciler / Mod Senaryolari): checkbox+yazi
  // ayni satirda, dikeyde ortalanmis, birden fazla checkbox yan yana kirilarak dizilir.
  css += ".cb-grid{display:flex;flex-wrap:wrap;gap:6px 18px;align-items:center}";
  css += ".cb-grid p{flex-basis:100%;margin:0 0 4px;color:var(--muted);font-size:12px}";
  css += ".cb{display:flex;align-items:center;gap:6px;margin-top:0;font-size:13px;color:var(--text);width:auto}";
  // NOT: genel "input,select{width:100%;padding:11px;border:2px solid...}" kurali
  // checkbox'lari da dev, kenarlikli kutulara ceviriyordu - burada sifirlaniyor.
  css += ".cb input[type=checkbox],.cb input[type=radio]{width:16px;height:16px;flex-shrink:0;padding:0;border:1px solid var(--input-border);margin:0;background:var(--input-bg)}";
  css += ".cb input[type=checkbox]{border-radius:4px}";
  css += "input,select{padding:11px;border:2px solid var(--input-border);border-radius:10px;font-size:14px;width:100%;margin-top:4px;background:var(--input-bg);color:var(--text)}";
  css += ".sonuc-metni{margin-top:10px;font-size:13px;text-align:center;color:var(--muted);min-height:16px}";
  css += ".muted{color:var(--muted);font-size:13px;text-align:center;padding:10px 0}";
  css += "table{width:100%;border-collapse:collapse;font-size:12px}";
  css += "th{text-align:left;color:var(--muted);padding:6px 4px;border-bottom:2px solid var(--tab-bg)}";
  css += "td{padding:8px 4px;border-bottom:1px solid var(--tab-bg)}";
  css += ".belirsiz-satir{background:rgba(255,152,0,.12)}";
  css += ".uyari-metni{color:var(--warn);font-weight:bold}";
  css += ".duzenle-form{display:flex;flex-wrap:wrap;gap:6px;padding:8px 0}";
  css += ".duzenle-form select,.duzenle-form input{flex:1;min-width:90px;margin-top:0;padding:8px}";
  css += ".duzenle-form button{width:auto;margin-top:0;padding:8px 14px}";
  css += ".btn-sil{background:none;border:none;cursor:pointer;font-size:14px}";
  server.sendHeader("Cache-Control", "no-cache, no-store, must-revalidate");
  server.send(200, "text/css", css);
}

// ============ HTML/JS (firmware'e gomulu - bkz web_content.h) ============
// index.html ve app.js artik LittleFS'te ayri dosyalar degil, derleme
// sirasinda scripts/gen_web_content.py tarafindan uretilen web_content.h
// icinde PROGMEM sabiti olarak firmware'in kendi icinde. Dinamik degerler
// JS tarafinda /olc, /durum, /ayarlar API'lerinden cekilir.
void handleRoot() {
  // FIX: tarayici (ozellikle mobil) bu sayfayi/JS'i cache'leyip guncellemeleri
  // gostermeyebiliyordu - Cache-Control tek basina yetersiz kalabiliyordu,
  // Pragma/Expires de eklendi (eski/agresif mobil cache'ler icin).
  server.sendHeader("Cache-Control", "no-cache, no-store, must-revalidate");
  server.sendHeader("Pragma", "no-cache");
  server.sendHeader("Expires", "0");
  server.send_P(200, "text/html", INDEX_HTML);
}


// ============ SSE PUSH ============
void ssePush() {
  if (!sseAktif) return;
  if (!sseClient.connected()) { sseAktif = false; return; }
  String data = "data: " + durumJson() + "\n\n";
  sseClient.print(data);
}

void handleSSE() {
  if (sseAktif) { sseClient.stop(); sseAktif = false; }
  sseClient = server.client();
  sseClient.setNoDelay(true);
  sseClient.print(
    "HTTP/1.1 200 OK\r\n"
    "Content-Type: text/event-stream\r\n"
    "Cache-Control: no-cache\r\n"
    "Connection: keep-alive\r\n"
    "Access-Control-Allow-Origin: *\r\n"
    "\r\n"
  );
  sseAktif = true;
  ssePush();  // ilk veriyi hemen gönder
}

